                    Data Handling in Python using Pandas

In [ ]:
# Data Str. in Pandas
# Series :  One-dim
# How to create series in Pandas-
#In-build function  Series() used to crete series

# how to create a series using list

import pandas as pd 
empseries = pd.Series(['John','Williams','Allen'])
print(empseries)

In [ ]:
# how to create a series using Dictionary

import pandas as pd

#create a dictionary
product  = {'Prod_ID':1001, 'Name':'Laptop','Price':65000}

#create a series
prod_ser = pd.Series(product)

print(prod_ser)

In [ ]:
#Head & Tail function in Series-
#head() : used to access first 5 rows of a series

import pandas as pd

s = pd.Series(['Desktop','Laptop','Printer','Keyboard','Mouse','USB'])
print(s)
print(s.head())
print('.....head() with parameter...')
print(s.head(3))

In [ ]:
#tail() : used to last 5 rows of a series
import pandas as pd

s = pd.Series(['Desktop','Laptop','Printer','Keyboard','Mouse','USB'])
print(type(s))
#print(s)
#print(s.tail()) #fetch last five records
print(s.tail(2)) #fetch last two records

In [ ]:
#Selection in series
#loc() - location
#iloc() - indexlocation

#syntax: s_name.loc[startIndex : endIndex] (index included)
import pandas as pd

s = pd.Series(['Desktop','Laptop','Printer','Keyboard','Mouse','USB'])
#print(s)
#print(s.loc[:2]) #to print values from index 0 to 2
print(s.loc[3:4])

In [ ]:
import pandas as pd
#iloc : Range

s = pd.Series(['Desktop','Laptop','Printer','Keyboard','Mouse','USB'])
print(s.iloc[:2])
print(s.iloc[3:4])

In [ ]:
# how to fetch sp. element from a series
import pandas as pd

s = pd.Series(['Desktop','Laptop','Printer','Keyboard','Mouse','USB'])
print(s[4])

In [ ]:
#slicing with step
import pandas as pd

s = pd.Series(['Desktop','Laptop','Printer','Keyboard','Mouse','USB'])
print(s[1::2])

In [ ]:
#DataFrame : (multi-dim/tabular)
#how to create a dataframe

#In-build DataFrame()
#dataframe creation using series...

import pandas as pd
s = pd.Series(['Desktop','Laptop','Printer','Keyboard','Mouse','USB'])
d = pd.DataFrame(s)
print(d)

In [ ]:
#Dataframe from Dictionary of Series
import pandas as pd

pname = pd.Series(['Desktop','Laptop','Tablet'])
pqty = pd.Series([20,15,12])
pprice = pd.Series([20000,55000,15000])

pdic = {'Name':pname, 'Price':pprice,'PQuantity':pqty}

prod_df = pd.DataFrame(pdic)
#print(prod_df)
print(prod_df[["Name","PQuantity"]])

In [ ]:
#DataFrame from list of Dictionaries
import pandas as pd

lst = [{'Name':'Desktop','Price':'20000'}, {'Name':'Laptop','Price':'60000'}, {'Name':'Tablet','Price':'12000'}]
df1 = pd.DataFrame(lst)
print(df1)

In [ ]:
#Iteration on Rows and columns
#fetch row-wise or column-wise records from Dataframe
#1. iterrows()
#2. iteritems() - (items())

#iterrows() : row-wise
import pandas as pd

lst = [{'Name':'Desktop','Price':'20000'}, {'Name':'Laptop','Price':'60000'}, {'Name':'Tablet','Price':'12000'}]
df1 = pd.DataFrame(lst)
for (row_idex,row_value) in df1. iterrows():
    print("\n Row index is :",row_idex)
    print("\n Row value is :",row_value)

In [ ]:
#Iteration on Rows and columns
#fetch row-wise or column-wise records from Dataframe
#1. iterrows()
#2. iteritems()

#iteritems() : column-wise
import pandas as pd

lst = [{'Name':'Desktop','Price':'20000'}, {'Name':'Laptop','Price':'60000'}, {'Name':'Tablet','Price':'12000'}]
df1 = pd.DataFrame(lst)
for (col_name,col_value) in df1. iteritems():
    print("\nRow index is :",col_name)
    print("\nRow value is :\n",col_value)

In [1]:
#select operation in DataFrame
#access column data 

import pandas as pd

employeedet ={'empid':[101,102,103,104,105],'ename':['Allen','Donald','Kelly','Pattrick','Williams'],'esalary':[25000,30000,45000,40000,34000]}
emp_df = pd.DataFrame(employeedet)
print(emp_df)

   empid     ename  esalary
0    101     Allen    25000
1    102    Donald    30000
2    103     Kelly    45000
3    104  Pattrick    40000
4    105  Williams    34000

In [2]:
print(emp_df.empid)

0    101
1    102
2    103
3    104
4    105
Name: empid, dtype: int64

In [5]:
print(emp_df[['empid','esalary']])

   empid  esalary
0    101    25000
1    102    30000
2    103    45000
3    104    40000
4    105    34000

In [8]:
#How to add new column to dataframe
import pandas as pd

employeedet ={'empid':[101,102,103,104,105],'ename':['Allen','Donald','Kelly','Pattrick','Williams'],'esalary':[25000,30000,45000,40000,34000]}
emp_df = pd.DataFrame(employeedet)
#print(emp_df)
#adding new column to a dataframe
emp_df['joining_date']=['12-05-2018','01-07-2015','23-02-2016','1-04-2019','10-05-2015']
print(emp_df)

   empid     ename  esalary joining_date
0    101     Allen    25000   12-05-2018
1    102    Donald    30000   01-07-2015
2    103     Kelly    45000   23-02-2016
3    104  Pattrick    40000    1-04-2019
4    105  Williams    34000   10-05-2015

In [11]:
#How to add new column to dataframe
import pandas as pd

employeedet ={'empid':[101,102,103,104,105],'ename':['Allen','Donald','Kelly','Pattrick','Williams'],'esalary':[25000,30000,45000,40000,34000]}
e_df = pd.DataFrame(employeedet)
print(e_df)
e_df['Salary_with_bonus']=e_df['esalary']+e_df['esalary']*.05
print(e_df)

   empid     ename  esalary
0    101     Allen    25000
1    102    Donald    30000
2    103     Kelly    45000
3    104  Pattrick    40000
4    105  Williams    34000

   empid     ename  esalary  Salary_with_bonus
0    101     Allen    25000            26250.0
1    102    Donald    30000            31500.0
2    103     Kelly    45000            47250.0
3    104  Pattrick    40000            42000.0
4    105  Williams    34000            35700.0

In [15]:
#how to rename the column
e_df.rename(columns = {"empid":"employee_ID"}, inplace=True)
print(e_df)

   employee_ID     ename  esalary  Salary_with_bonus
0          101     Allen    25000            26250.0
1          102    Donald    30000            31500.0
2          103     Kelly    45000            47250.0
3          104  Pattrick    40000            42000.0
4          105  Williams    34000            35700.0

In [17]:
#how to drop a column from a dataframe
#drop() - column-wise (axis=1)
e_df = e_df.drop('Salary_with_bonus',axis=1)
print(e_df)

   employee_ID     ename  esalary
0          101     Allen    25000
1          102    Donald    30000
2          103     Kelly    45000
3          104  Pattrick    40000
4          105  Williams    34000

In [33]:
#how to drop a rows from a dataframe
#drop() : row-wise (axis=0)
'''
e_df = e_df.drop(index=[2,3],axis=0)
'''
e_df.reset_index(inplace=True)
print(e_df)

AttributeError: 'NoneType' object has no attribute 'reset_index'

In [36]:
#accessing data from dataframe using loc & iloc

#syntax : df.loc[startrow:EndRow, Startcolumn:EndColumn]
import pandas as pd

employeedet ={'empid':[101,102,103,104,105],'ename':['Allen','Donald','Kelly','Pattrick','Williams'],'esalary':[25000,30000,45000,40000,34000]}
e_df = pd.DataFrame(employeedet)
print(e_df.loc[2:3, : ])
print(e_df.loc[2:3, 'empid':'ename'])

   empid     ename
2    103     Kelly
3    104  Pattrick

In [39]:
e_df
#top 2 records
#e_df.head(2)
e_df.tail(2)

   empid     ename  esalary
3    104  Pattrick    40000
4    105  Williams    34000